//===============================================================
//文件名称：hw_rtc.c
//功能概要：K60 RTC构件驱动程序源文件
//版权所有：苏州大学飞思卡尔嵌入式中心(sumcu.suda.edu.cn)
//版本更新：2011-11-13  V1.0   初始版本
//          2011-11-17  V1.1   规范排版风格
//===============================================================

#include "hw_rtc.h"             //RTC驱动程序头文件  

//===============================================================
//函数名称：hw_rtc_init
//函数参数：SecendTimes:定时器秒寄存器的初始值
//         AlarmTimes:定时器报警寄存器的时间间隔
//函数返回：无
//功能概要：RTC驱动初始化
//===============================================================
void hw_rtc_init(uint32 SecendTimes,uint32 AlarmTimes)
{
	int i;
    SIM_SCGC6 |= SIM_SCGC6_RTC_MASK;//使能RTC时钟门控制
    
    RTC_CR  = RTC_CR_SWR_MASK;//软件复位RTC寄存器
    RTC_CR  &= ~RTC_CR_SWR_MASK;//软件复位之后清SWR位
    RTC_CR |= RTC_CR_OSCE_MASK;//使能32.768kHz振荡器
    
    for(i=0;i<0x600000;i++);//在使能32.768kHz振荡器之后，使能计数器
                                //之前等待一段时间，来稳定32.768kHz时钟。
    
    RTC_TCR = RTC_TCR_CIR(0) | RTC_TCR_TCR(0);//配置定时器补偿寄存器的时间间隔与时钟周期数

    RTC_TSR = SecendTimes;//初始化定时器秒寄存器

    RTC_TAR = AlarmTimes;//初始化定时器报警寄存器
    
    RTC_TPR = 0;        //复位RTC定时器预分频器寄存器
}

//===============================================================
//函数名称：hw_rtc_start
//函数参数：无
//函数返回：无
//功能概要：启动RTC模块
//===============================================================
void hw_rtc_start(void)
{
    RTC_SR |= RTC_SR_TCE_MASK;//打开计数器
}

//===============================================================
//函数名称：hw_rtc_stop
//函数参数：无
//函数返回：无
//功能概要：关闭RTC模块
//===============================================================
void hw_rtc_stop(void)
{
    RTC_SR &= ~RTC_SR_TCE_MASK;//关闭计数器
}

//===============================================================
//函数名称：hw_rtc_reset_alarm_time
//函数参数：AlarmTimes复位时赋给报警计时器的值
//函数返回：无
//功能概要：复位报警计时器
//===============================================================
void hw_rtc_reset_alarm_time(uint32 AlarmTimes)
{
    RTC_TAR = AlarmTimes;
}

//===============================================================
//函数名称：hw_rtc_reset_second_time
//函数参数：SecondTimes复位时赋给秒计时器的值 
//函数返回：无
//功能概要：复位秒计时器   
//===============================================================
void hw_rtc_reset_second_time(uint32 SecondTimes)
{
    RTC_TSR = SecondTimes;
}

//===============================================================
//函数名称：hw_enable_rtc_int                                                  
//功能概要：开rtc中断                                           
//函数返回：无                                                               
//===============================================================
void hw_enable_rtc_int()
{
	enable_irq(RTC_irq_no);  //开rtc中断
}

//===============================================================
//函数名称：hw_disable_rtc_int                                                  
//功能概要：开rtc中断                                           
//函数返回：无                                                               
//===============================================================
void hw_disable_rtc_int()
{
	disable_irq(RTC_irq_no);  //关rtc中断
}
