//===============================================================
//文件名称：hw_rtc.h
//功能概要：K60 RTC构件驱动程序头文件
//版权所有：苏州大学飞思卡尔嵌入式中心(sumcu.suda.edu.cn)
//版本更新：2011-11-13  V1.0   初始版本
//          2011-11-17  V1.1   规范排版风格
//===============================================================

#ifndef __RTC_H__
#define __RTC_H__

//1 头文件
#include "common.h"

//2 宏定义
#define   RTC_irq_no    66

//3 函数声明

//===============================================================
//函数名称：hw_rtc_init
//函数参数：SecendTimes:定时器秒寄存器的初始值
//         AlarmTimes:定时器报警寄存器的时间间隔
//函数返回：无
//功能概要：RTC驱动初始化
//===============================================================
void hw_rtc_init(uint32 SecendTimes,uint32 AlarmTimes);

//===============================================================
//函数名称：hw_rtc_start
//函数参数：无
//函数返回：无
//功能概要：启动RTC模块
//===============================================================
void hw_rtc_start(void);

//===============================================================
//函数名称：hw_rtc_stop
//函数参数：无
//函数返回：无
//功能概要：关闭RTC模块
//===============================================================
void hw_rtc_stop(void);

//===============================================================
//函数名称：hw_rtc_reset_alarm_time
//函数参数：AlarmTimes复位时赋给报警计时器的值
//函数返回：无
//功能概要：复位报警计时器
//===============================================================
void hw_rtc_reset_alarm_time(uint32 AlarmTimes);

//===============================================================
//函数名称：hw_rtc_reset_second_time
//函数参数：SecondTimes复位时赋给秒计时器的值 
//函数返回：无
//功能概要：复位秒计时器   
//===============================================================
void hw_rtc_reset_second_time(uint32 SecondTimes);

//===============================================================
//函数名称：hw_enable_rtc_int                                                  
//功能概要：开rtc中断                                           
//函数返回：无                                                               
//===============================================================
void hw_enable_rtc_int();

//===============================================================
//函数名称：hw_disable_rtc_int                                                  
//功能概要：开rtc中断                                           
//函数返回：无                                                               
//===============================================================
void hw_disable_rtc_int();

#endif /* __RTC_H__ */
