//============================================================================
// 文件名称：hw_pdb.h                                                          
// 功能概要：PDB构件头文件
// 版权所有: 苏州大学飞思卡尔嵌入式中心(sumcu.suda.edu.cn)
// 版本更新:     时间                     版本                                       修改
//           2011-11-17     V1.0       编写了K60的PDB驱动
//============================================================================

#ifndef __HW_PDB_H__
#define __HW_PDB_H__
	
//包含头文件
#include "common.h"          //包含公共类型定义

//宏定义

//中断号
#define PDB_isr_no 72

//函数接口声明
//==========================================================================
//函数名称：hw_pdb_init                                                  
//功能概要：PDB初始化
//         1.设置成软件触发器输入
//         2.使能PDB模块
//         3.预分频设置成0
//         4. LDMOD = 0: 在设置完LDOK后立即加载
//         5. 使能PDB中断
//         注意：只有在使能PDB模块后，才可以写入通道延时值                                                 
//参数说明：无                                                    
//函数返回：无                                                               
//==========================================================================
void hw_pdb_init(void);

//==========================================================================
//函数名称：hw_enable_pdb_int                                                  
//功能概要：开pdb中断                                                   
//参数说明：无                                                    
//函数返回：无                                                               
//==========================================================================
void hw_enable_pdb_int(void);

//==========================================================================
//函数名称：hw_disable_pdb_int                                               
//功能概要：关pdb中断                                                   
//参数说明：无                                                                                                           
//函数返回：无                                                               
//==========================================================================
void hw_disable_pdb_int(void);

#endif /* __HW_PDB_H__ */
