//============================================================================
//文件名称：hw_uart.h
//功能概要：K60 UART底层驱动程序头文件
//版权所有：苏州大学飞思卡尔嵌入式中心(sumcu.suda.edu.cn)
//版本更新：2011-11-13  V1.0   初始版本
//          2011-12-20  V1.1   规范排版
//============================================================================

#ifndef UART_H__
#define UART_H__
	
//1 头文件
#include "common.h"

//2 宏定义

#define UART_MAX_NUM  6  //K60最多有6个串口编号

//2.1 串口号宏定义
#define UART_0 0
#define UART_1 1
#define UART_2 2
#define UART_3 3
#define UART_4 4
#define UART_5 5

//串行通信寄存器及标志位定义
#define ReSendStatusR(base)    ((base)->S1) //状态寄存器
#define ReSendDataR(base)      ((base)->D)  //数据寄存器

#define ReTestBit       5     //接收缓冲区满标志位
#define SendTestBit     7     //发送缓冲区空标志位


//=================接口函数声明============================================
//=========================================================================
//函数名称：hw_uart_init                                                        
//功能概要：初始化uartx模块。                                                
//参数说明：uartNo:串口号                                                                               
//          baud:波特率，如9600，38400等，一般来说，速度越慢，通信越稳       
//函数返回：函数执行状态：0=正常；非0=异常
//=========================================================================
uint8 hw_uart_init (uint8 uartNo, uint32 baud);

//=========================================================================
//函数名称：hw_uart_re1
//参数说明：uartNo: 串口号
//          fp:接收成功标志的指针:*p=0，成功接收；*p=1，接收失败
//函数返回：接收返回字节
//功能概要：串行接收1个字节
//=========================================================================
uint8 hw_uart_re1 (uint8 uartNo,uint8 *fp);

//=========================================================================
//函数名称：hw_uart_send1
//参数说明：uartNo: 串口号
//          ch:要发送的字节
//函数返回：函数执行状态：0=正常；非0=异常。
//功能概要：串行发送1个字节
//=========================================================================
uint8 hw_uart_send1(uint8 uartNo, uint8 ch);

//=========================================================================
//函数名称：hw_uart_reN                                                         
//功能概要：串行 接收n个字节                                                 
//参数说明：uartNo: 串口号                                                   
//          buff: 接收缓冲区                                                 
//		   len:接收长度                                                     
//函数返回： 1:成功;0:失败                                                    
//=========================================================================
uint8 hw_uart_reN (uint8 uartNo ,uint16 len ,uint8* buff);

//=========================================================================
//函数名称：hw_uart_sendN
//参数说明：uartNo: 串口号
//          buff: 发送缓冲区
//          len:发送长度
//函数返回：函数执行状态：0=正常；1=异常。
//功能概要：串行接收n个字节   
//=========================================================================
uint8 hw_uart_sendN (uint8 uartNo ,uint16 len ,uint8* buff);

//=========================================================================
//函数名称：hw_uart_send_string
//参数说明：uartNo:UART模块号
//          buff:要发送的字符串的首地址
//函数返回：函数执行状态：0=正常；非0=异常。
//功能概要：从指定UART端口发送一个以'\0'结束的字符串
//=========================================================================
uint8 hw_uart_send_string(uint8 uartNo, void *buff);

//=========================================================================
//函数名称：hw_uart_enable_re_int
//参数说明：uartNo: 串口号
//函数返回：无
//功能概要：开串口接收中断
//=========================================================================
void hw_uart_enable_re_int(uint8 uartNo);

//=========================================================================
//函数名称：hw_uart_disable_re_int
//参数说明：uartNo: 串口号 
//函数返回：无
//功能概要：关串口接收中断
//=========================================================================
void hw_uart_disable_re_int(uint8 uartNo);



#endif
